
//35. একটি জংগলের ১ম ১০ মাইলের প্রত্যেক মাইলে ১০টি করে প্রানী দেখা যায়।  ২য় দশমাইলের প্রত্যেক মাইলে ৫০ টি করে প্রাণী দেখা যায়।  এরপর থেকে প্রত্যেক মাইলে ১০০ করে প্রাণী দেখা যায়। একটি প্রোগ্রাম লেখো যেখানে ফাংশানের প্যারামিটারে দেওয়া হবে আমি কত মাইল পর্যন্ত গিয়েছি এবং এত মাইলে কতগুলো প্রাণী দেখেছি। যেমনঃ ৭ মাইল গেলে ৭০ টি, ১৩ মাইল গেলে ২৫০ টি, ২৫ মাইল গেলে ১১০০টি প্রানী রিটার্ন দেখাবে। 

let jungle = (miles) => {
    let for10miles;
    let for20miles = 100 + ((miles-10)*50);
    let for30miles = (10*10) + (10*50) + ((miles-20)*100);
    if(miles>0 && miles<=10){
        for10miles = miles * 10;
        return for10miles;
    }else if(miles>10 && miles<=20){
        return for20miles;
    }else if(miles>20){
        return for30miles;
    }
}
console.log(jungle(25));