/*  arr = [14, 58, 98, 58, 96, 58, 65, 202, 58, 205, 58, 58, 95, 70, 58, 50, 58, 21, 25, 58,58,58 ]; এই এরের সবগুলো 58 সংখ্যাকে সিরিয়াল অনুযায়ী  extra = [1000, 2000, 3000, 5000];
 চেঞ্জ করে  দেখাও। অর্থাৎ প্রথম 58 সংখ্যাটি চেঞ্জ হয়ে 1000,  ২য় 58 সংখ্যাটি চেঞ্জ হয়ে 200, এভাবে 5000 পর্যন্ত চেঞ্জ হবে। এরপরে আবার নতুন করে 1000 থেকে চেঞ্জ হবে।  */

 let arr = [14, 58, 98, 58, 96, 58, 65, 202, 58, 205, 58, 58, 95, 70, 58, 50, 58, 21, 25, 58,58,58 ];

 const dummy = (model) => {
    let extra = [1000, 2000, 3000, 5000];
    let n = 0;
    for(let element of model){
        if(element === 58){
            let x = model.indexOf(element);
            model[x] = extra[n];
            n++;
            if(n===extra.length){
                n=0;
            }
        }
    }
    return model;
 }

console.log(dummy(arr));
